tests/load/reports/load-test-20260906-052833.log

📊 SIMPLE LOAD TEST

Target: http://localhost:3000
Testing without authentication to get baseline metrics

Test 1: Health Check Endpoint

📈 Health Check Results:
═══════════════════════════════════════
Total Requests:  4103
Requests/sec:    410.30
Throughput:      0.09 MB/s

Latency:
  Avg:           23.80ms
  P50:           21.00ms
  P95:           0.00ms
  P99:           61.00ms

Errors:
  Errors:        0
  Timeouts:      0
  Non-2xx:       4103

---

Test 2: Baseline Load Test (50 connections, 30s)
Running 30s test @ http://localhost:3000
50 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max     │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼─────────┤
│ Latency │ 115 ms │ 133 ms │ 188 ms │ 221 ms │ 139.15 ms │ 39.66 ms │ 1918 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 244     │ 244     │ 367     │ 412     │ 357.54  │ 38.04  │ 244     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 4.16 MB │ 4.16 MB │ 6.25 MB │ 7.02 MB │ 6.09 MB │ 648 kB │ 4.16 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

11k requests in 30.04s, 183 MB read

📈 Baseline Results:
═══════════════════════════════════════
Total Requests:  10726
Requests/sec:    357.54
Throughput:      5.81 MB/s

Latency:
  Avg:           139.15ms
  P50:           133.00ms
  P95:           0.00ms
  P99:           221.00ms

Errors:
  Errors:        0
  Timeouts:      0
  Non-2xx:       0

---

Test 3: Stress Test (200 connections, 30s)
Running 30s test @ http://localhost:3000
200 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 286 ms │ 354 ms │ 443 ms │ 488 ms │ 369.05 ms │ 283.76 ms │ 9694 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg    │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┤
│ Req/Sec   │ 312     │ 312     │ 363     │ 397     │ 358.47 │ 22.25  │ 312     │
├───────────┼─────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┤
│ Bytes/Sec │ 5.32 MB │ 5.32 MB │ 6.18 MB │ 6.76 MB │ 6.1 MB │ 379 kB │ 5.31 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

11k requests in 30.18s, 183 MB read
183 errors (183 timeouts)

📈 Stress Test Results:
═══════════════════════════════════════
Total Requests:  10754
Requests/sec:    358.47
Throughput:      5.82 MB/s

Latency:
  Avg:           369.05ms
  P50:           354.00ms
  P95:           0.00ms
  P99:           488.00ms

Errors:
  Errors:        183
  Timeouts:      183
  Non-2xx:       0